-- --------------------------------------------------

-- [一時的なデータを保存するファイル]

-- --------------------------------------------------
local data = {}
-- 新しくゲームを始めたか
data.new_game = true
-- --------------------------------------------------
-- スクリプト状態データ 各スクリプト別に保存
-- --------------------------------------------------
data.game_state = {
	game = ""
}
data.pre_state = {
	game = ""
}
-- --------------------------------------------------
-- 定数
-- --------------------------------------------------
-- ボールの種類数
data.TYPE_NUM = 11
-- 引けるボールの種類数
data.PULL_TYPE_NUM = 4
-- 手持ちボールの位置
data.HAND_POS = vmath.vector3(198,678,0)
-- ボール落とす範囲
data.DROP_RANGE = {min = 64, max = 424}
-- ボールが消えた時の加点テーブル
data.BALL_SCORE = {
	1,
	2,
	5,
	8,
	11,
	16,
	21,
	32,
	49,
	96,
	150,
}
-- --------------------------------------------------------
-- URL
-- --------------------------------------------------------
data.BOX_URL = "main:/boxs#handler_box"
data.C_URL = "/common#game"
-- --------------------------------------------------
-- ゲーム一時データ
-- --------------------------------------------------
-- 手持ちのボール番号
data.ball = 1
-- 次のボール番号
data.next_ball = 1
-- スコア
data.score = 0
data.pre_score = 0		-- 前回のベストスコア
-- --------------------------------------------------
-- 保存するゲームデータ
-- save_handler.luaで外部ファイルに読み書きする
-- --------------------------------------------------
-- スコア
data.best_score = 0
-- 音オンオフ
data.bgm = 0
data.sound = 0

return data